Repository: RizdkyOktaviari/Popular_fruit_flutter
Catalog: lib/l10n/app_*.arb
Languages: id, ms

# language
source: English
id: Indonesian
ms: Malay

source: Hello World!
id: Halo Dunia!
ms: Hai dunia!

# hello
source: Hello {username}
id: Halo {username}
ms: Hai {username}

# takephoto
source: Take a Photo
id: Mengambil Foto
ms: Ambil Gambar

source: Upload Image
id: Unggah Gambar
ms: Muat Naik Imej

source: Scan Fruit
id: Pindai Buah
ms: Imbas Buah

source: Learn Fruits
id: Pelajari Buah
ms: Belajar Buah-buahan

source: Setting
id: Pengaturan
ms: Tetapan

source: Language Setting
id: Pengaturan Bahasa
ms: Tetapan Bahasa

source: Apple
id: Apel
ms: Epal

source: Banana
id: Pisang
ms: Pisang

source: Beetroot
id: Bit
ms: Bit

source: Bell Pepper
id: Paprika
ms: Lada Benggala

source: Cabbage
id: Kubis
ms: Kubis

source: Carrot
id: Wortel
ms: Lobak

source: Cauliflower
id: Kol
ms: Kembang Kobis

source: Chilli Pepper
id: Cabe
ms: Cili

source: Corn
id: Jagung
ms: Jagung

source: Cucumber
id: Mentimun
ms: Timun

source: Eggplant
id: Terong
ms: Terung

source: Garlic
id: Bawang Putih
ms: Bawang Putih

source: Ginger
id: Jahe
ms: Halia

source: Grapes
id: Anggur
ms: Anggur

source: Jalepeno
id: Cabe Jalepeno

source: Lemon
id: Jeruk Lemon

source: Lettuce
id: Selada
ms: Selada

source: Mango
id: Mangga
ms: Mangga

source: Onion
id: Bawang Merah
ms: Bawang Besar

source: Orange
id: Jeruk
ms: Oren

source: Pear
id: Pir
ms: Pir

source: Peas
id: Kacang Polong
ms: Kacang Peas

source: Pineapple
id: Nanas
ms: Nanas

source: Pomegranate
id: Delima
ms: Delima

source: Potato
id: Kentang
ms: Kentang

source: Raddish
id: Lobak
ms: Lobak Merah

source: Soy Beans
id: Kacang Kedelai
ms: Kacang Soya

source: Spinach
id: Bayam
ms: Bayam

source: Sweetcorn
id: Jagung Manis
ms: Jagung Manis

source: Sweetpotato
id: Ubi Jalar
ms: Ubi

source: Tomato
id: Tomat

source: Turnip
id: Lobak
ms: Lobak Putih

source: Watermelon
id: Semangka
ms: Tembikai

# appleDes
source: A round fruit with various colors and a crisp texture.
id: Buah bulat dengan berbagai warna dan tekstur renyah.
ms: Buah bulat dengan pelbagai warna dan tekstur yang ranggi.

# bananaDes
source: A long, curved fruit with a yellow skin and soft, sweet flesh.
id: Buah yang panjang dan melengkung dengan kulit kuning dan daging yang lembut dan manis.
ms: Buah panjang berlekuk dengan kulit kuning dan daging yang lembut dan manis.

# beetrootDes
source: A root vegetable with a deep purple-red color and a slightly sweet taste.
id: Sayuran akar dengan warna merah ungu tua dan rasa sedikit manis.
ms: Sayur akar dengan warna ungu merah tua dan rasa yang sedikit manis.

# bellPepperDes
source: A colorful vegetable with a crunchy texture and a mild, sweet flavor.
id: Sayuran berwarna-warni dengan tekstur renyah dan rasa manis yang ringan.
ms: Sayur berwarna-warni dengan tekstur renyah dan rasa yang lembut dan manis.

# cabbageDes
source: A leafy vegetable with thick, layered leaves and a slightly bitter taste.
id: Sayuran berdaun tebal dengan rasa sedikit pahit.
ms: Sayur berdaun tebal dengan rasa sedikit pahit.

# capsicumDes
source: Also known as bell pepper, it is a vegetable available in various colors and has a mild flavor.
id: Juga dikenal sebagai paprika, sayuran ini tersedia dalam berbagai warna dan memiliki rasa ringan.
ms: Juga dikenali sebagai lada bell, ia adalah sayur yang tersedia dalam pelbagai warna dan mempunyai rasa yang lembut.

# carrotDes
source: An orange root vegetable with a sweet taste and a crunchy texture.
id: Sayuran akar berwarna oranye dengan rasa manis dan tekstur renyah.
ms: Sayur akar berwarna oren dengan rasa manis dan tekstur yang renyah.

# cauliflowerDes
source: A vegetable with a compact head made up of undeveloped flower buds and a mild flavor.
id: Sayuran dengan kepala padat yang terdiri dari bunga yang belum berkembang dan memiliki rasa ringan.
ms: Sayur dengan kepala padat terdiri daripada tunas bunga yang belum berkembang dan rasa yang lembut.

# chilliPepperDes
source: A spicy vegetable with various shapes, sizes, and levels of heat.
id: Sayuran pedas dengan berbagai bentuk, ukuran, dan tingkat kepedasan.
ms: Sayur pedas dengan pelbagai bentuk, saiz, dan tahap kepedasan.

# cornDes
source: A cereal grain with sweet, juicy kernels that are typically yellow or white.
id: Biji sereal dengan biji yang manis dan juicy yang biasanya berwarna kuning atau putih.
ms: Biji-bijian sereal dengan biji jagung manis dan lembut yang biasanya berwarna kuning atau putih.

# cucumberDes
source: A long, cylindrical vegetable with a refreshing taste and a high water content.
id: Sayuran silindris panjang dengan rasa segar dan kandungan air yang tinggi.
ms: Sayur silinder panjang dengan rasa menyegarkan dan kandungan air yang tinggi.

# eggplantDes
source: A purple vegetable with a smooth and shiny skin, often used in cooking.
id: Sayuran berwarna ungu dengan kulit yang halus dan mengkilap, sering digunakan dalam masakan.
ms: Sayur ungu dengan kulit yang licin dan berkilauan, sering digunakan dalam masakan.

# garlicDes
source: A pungent bulbous vegetable with a strong flavor commonly used as a seasoning.
id: Sayuran umbi yang pedas dengan rasa kuat yang umumnya digunakan sebagai bumbu.
ms: Sayur berumbi yang tajam dengan rasa yang kuat yang biasa digunakan sebagai perisa.

# gingerDes
source: A knobby root with a spicy and aromatic flavor used in both sweet and savory dishes.
id: Akar yang bergerigi dengan rasa pedas dan aromatik yang digunakan dalam hidangan manis maupun gurih.
ms: Akar berbonggol dengan rasa pedas dan aromatik yang digunakan dalam hidangan manis dan masam.

# grapesDes
source: Small, juicy fruits that grow in clusters and come in various colors and flavors.
id: Buah kecil dan juicy yang tumbuh dalam kelompok dan memiliki berbagai warna dan rasa.
ms: Buah kecil berair yang tumbuh dalam gugusan dan datang dalam pelbagai warna dan rasa.

# jalepenoDes
source: A spicy chili pepper commonly used in Mexican cuisine.
id: Cabai pedas yang umum digunakan dalam masakan Meksiko.
ms: Lada cili pedas yang biasa digunakan dalam masakan Mexico.

# kiwiDes
source: A small fruit with a brown, fuzzy skin and bright green flesh that is tangy and sweet.
id: Buah kecil dengan kulit berwarna coklat berbulu dan daging berwarna hijau terang yang asam dan manis.
ms: Buah kecil dengan kulit berbulu coklat dan daging hijau terang yang masam dan manis.

# lemonDes
source: A citrus fruit with a sour taste commonly used for its juice and zest in cooking.
id: Buah jeruk dengan rasa asam yang umum digunakan untuk jus dan parutan kulit dalam masakan.
ms: Buah sitrus dengan rasa masam yang biasa digunakan untuk jus dan zeste dalam masakan.

# lettuceDes
source: A leafy vegetable often used as the base for salads.
id: Sayuran berdaun hijau yang sering digunakan sebagai dasar salad.
ms: Sayur daun yang sering digunakan sebagai dasar salad.

# mangoDes
source: A tropical fruit with a sweet, juicy flesh and a distinctive flavor.
id: Buah tropis dengan daging manis dan juicy serta memiliki rasa yang khas.
ms: Buah tropika dengan daging yang manis dan berair dan rasa yang khas.

# onionDes
source: A pungent bulb vegetable with layers of papery skin, used as a flavoring in many dishes.
id: Sayuran umbi yang pedas dengan lapisan kulit yang tipis, digunakan sebagai penyedap dalam banyak masakan.
ms: Sayur berumbi tajam dengan lapisan kulit kertas, digunakan sebagai perisa dalam banyak hidangan.

# orangeDes
source: A citrus fruit with a bright orange color and a sweet, tangy taste.
id: Buah jeruk dengan warna oranye cerah dan rasa manis serta asam.
ms: Buah sitrus dengan warna jingga terang dan rasa manis dan masam.

# paprikaDes
source: A spice made from dried and ground bell peppers or chili peppers.
id: Bumbu yang terbuat dari paprika atau cabai kering dan dihaluskan.
ms: Rempah yang terbuat dari lada bell atau lada cili yang dikeringkan dan digiling.

# pearDes
source: A fruit with a sweet, juicy flesh and a distinctive shape.
id: Buah dengan daging manis dan juicy serta memiliki bentuk yang khas.
ms: Buah dengan daging yang manis dan berair dan bentuk yang khas.

# peasDes
source: Small spherical green vegetables often used as a side dish or in soups and stews.
id: Sayuran kecil berbentuk bulat berwarna hijau sering digunakan sebagai hidangan sampingan atau dalam sup dan semur.
ms: Sayur hijau kecil berbentuk bulat yang sering digunakan sebagai hidangan sampingan atau dalam sup dan rebusan.

# pineappleDes
source: A tropical fruit with a sweet and tangy taste and a spiky exterior.
id: Buah tropis dengan rasa manis dan asam yang segar serta memiliki kulit yang berduri.
ms: Buah tropika dengan rasa manis dan masam dan kulit berduri.

# pomegranateDes
source: A fruit with a tough outer skin and juicy red seeds, known for its antioxidants.
id: Buah dengan kulit luar yang keras dan biji merah yang juicy, terkenal karena kandungan antioksidannya.
ms: Buah dengan kulit luar yang keras dan biji merah berair, terkenal dengan antioksidannya.

# potatoDes
source: An underground tuber with a starchy flesh that is commonly boiled, baked, or fried.
id: Umbi yang tumbuh di bawah tanah dengan daging yang mengandung pati yang biasanya direbus, dipanggang, atau digoreng.
ms: Ubi bawah tanah dengan daging yang berasa pati yang biasanya direbus, dipanggang, atau digoreng.

# radishDes
source: A small, crisp vegetable with a peppery taste and a vibrant color.
id: Sayuran kecil dan renyah dengan rasa pedas dan warna yang cerah.
ms: Sayur kecil yang renyah dengan rasa pedas dan warna yang cerah.

# soybeansDes
source: Legumes used for their high protein content and various culinary applications.
id: Kacang-kacangan yang digunakan karena kandungan protein tinggi dan berbagai aplikasi kuliner.
ms: Kacang polong yang digunakan kerana kandungan protein yang tinggi dan pelbagai aplikasi masakan.

# spinachDes
source: A leafy green vegetable with a mild flavor and high nutritional value.
id: Sayuran hijau berdaun dengan rasa ringan dan nilai gizi yang tinggi.
ms: Sayur hijau berdaun dengan rasa yang lembut dan nilai pemakanan yang tinggi.

# sweetcornDes
source: A variety of corn with sweet and juicy kernels.
id: Varietas jagung dengan biji yang manis dan juicy.
ms: Pelbagai jagung dengan biji yang manis dan berair.

# sweetpotatoDes
source: A root vegetable with a sweet taste and a moist texture.
id: Sayuran akar dengan rasa manis dan tekstur lembap.
ms: Sayur akar dengan rasa manis dan tekstur lembap.

# tomatoDes
source: A juicy fruit that is commonly used as a vegetable in cooking.
id: Buah yang juicy yang umumnya digunakan sebagai sayuran dalam masakan.
ms: Buah berair yang biasanya digunakan sebagai sayur dalam masakan.

# turnipDes
source: A root vegetable with a sharp flavor and a firm texture.
id: Sayuran akar dengan rasa tajam dan tekstur yang padat.
ms: Sayur akar dengan rasa tajam dan tekstur yang keras.

# watermelonDes
source: A large fruit with a sweet and juicy red or pink flesh, perfect for hot summer days.
id: Buah besar dengan daging merah atau pink yang manis dan juicy, sempurna untuk hari-hari panas.
ms: Buah besar dengan daging merah atau pink yang manis dan berair, sempurna untuk hari panas musim panas.

source: Fruit Details
id: Detail Buah
ms: Butiran Buah

source: Benefit
id: Keuntungan
ms: Keuntungan

# colorss
source: Color
id: Warna
ms: Warna

# mores
source: More
id: Lebih
ms: Lebih

source: Capsicum
ms: Kapsikum

source: Kiwi
ms: Kiwai
